config.org
* Default web browser
Taken, with thanks, from [[https://github.com/dakrone/eos/blob/master/eos-web.org][dakrone/eos at github]].

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x m") 'browse-url-at-point)

  (use-package eww
    :defer t
    :init
    (setq browse-url-browser-function
          '((".*google.*maps.*" . browse-url-generic)
            ;; Github goes to firefox, but not gist
            ("http.*\/\/github.com" . browse-url-generic)
            ("groups.google.com" . browse-url-generic)
            ("docs.google.com" . browse-url-generic)
            ("melpa.org" . browse-url-generic)
            ("build.*\.elastic.co" . browse-url-generic)
            (".*-ci\.elastic.co" . browse-url-generic)
            ("internal-ci\.elastic\.co" . browse-url-generic)
            ("zendesk\.com" . browse-url-generic)
            ("salesforce\.com" . browse-url-generic)
            ("stackoverflow\.com" . browse-url-generic)
            ("apache\.org\/jira" . browse-url-generic)
            ("thepoachedegg\.net" . browse-url-generic)
            ("zoom.us" . browse-url-generic)
            ("t.co" . browse-url-generic)
            ("twitter.com" . browse-url-generic)
            ("\/\/a.co" . browse-url-generic)
            ("youtube.com" . browse-url-generic)
            ("amazon.com" . browse-url-generic)
            ("slideshare.net" . browse-url-generic)
            ("." . eww-browse-url)))
    (setq browser-url-secondary-browser-function 'browse-url-generic)
    (setq browse-url-generic-program (executable-find "nyxt"))
    (add-hook 'eww-mode-hook #'toggle-word-wrap)
    (add-hook 'eww-mode-hook #'visual-line-mode)
    :config
    (use-package s :ensure t)
    (define-key eww-mode-map "o" 'eww)
    (define-key eww-mode-map "O" 'eww-browse-with-external-browser)
    (define-key eww-mode-map "j" 'next-line)
    (define-key eww-mode-map "k" 'previous-line))

  (use-package eww-lnum
      :straight t
      :after eww
      :config
      (bind-key "f" #'eww-lnum-follow eww-mode-map)
      (bind-key "U" #'eww-lnum-universal eww-mode-map))

  (require 'ffap)
  (defun browse-last-url-in-brower ()
    (interactive)
    (save-excursion
      (ffap-next-url t t)))

  ;; (global-set-key (kbd "C-c u") 'browse-last-url-in-brower)

#+END_SRC

* Dashboard

  This is your new startup screen, together with projectile it works in
unison and provides you with a quick look into your latest projects
and files. Change the welcome message to whatever string you want and
change the numbers to suit your liking, I find 5 to be enough.

#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
      (dashboard-setup-startup-hook)
      (setq dashboard-startup-banner "~/.emacs.d/img/dashLogo.png")
      (setq dashboard-items '((recents  . 5)
                              (projects . 5)))
      (setq dashboard-banner-logo-title "DeepSky Emacs"))
#+END_SRC
* The terminal
** Default shell should be zsh
Don't ask me what shell I want to use. In general this is a solved problem..
#+BEGIN_SRC emacs-lisp
  (defvar my-term-shell "/usr/bin/zsh")
  (defadvice ansi-term (before force-bash)
    (interactive (list my-term-shell)))
  (ad-activate 'ansi-term)
#+END_SRC
* Moving around in emacs

  Spending too much time flapping around between buffers, stuck in the
interstitial space where work goes to die.

** swiper and why is the default search so lame
   
Also revisiting this in our retooling around orderless, consult, marginalia, and embark.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package swiper
    :ensure t
    :bind ("C-s" . 'swiper))
#+END_SRC


* List buffers

source: http://ergoemacs.org/emacs/emacs_buffer_management.html

Auto-revert-mode updates buffers so that they reflect what is on the
disk. This is particularly useful in the presence of git or other
version control software which can change the files from beneath the
buffers in emacs. source: [[http://whattheemacsd.com/sane-defaults.el-01.html][Magnar Sveen]]

#+BEGIN_SRC emacs-lisp
  (add-hook 'dired-mode-hook 'auto-revert-mode)
  (global-auto-revert-mode t)

  ;; Also auto refresh dired, but be quiet about it
  (setq global-auto-revert-non-file-buffers t)
  (setq auto-revert-verbose nil)
#+END_SRC
* Recentf

#+BEGIN_SRC emacs-lisp
(use-package recentf
  :bind ("C-x C-r" . helm-recentf)
  :config
  (recentf-mode t)
  (setq recentf-max-saved-items 200))
#+END_SRC
* Tramp

#+BEGIN_SRC emacs-lisp
  (use-package tramp
    :ensure t
    :config
    ;; tramp hangs when remote has 'weird' prompt. Check in for this terminal type.
    (setf tramp-terminal-type "tramp")
    (add-to-list 'tramp-connection-properties
                 (list (regexp-quote "/ssh:fade@deepsky.com:")
                       "remote-shell" "/bin/sh"))) 
#+END_SRC
* Window

Convenient keybindings to resize windows.

#+BEGIN_SRC emacs-lisp
  (bind-key "C-s-<left>"  'shrink-window-horizontally)
  (bind-key "C-s-<right>" 'enlarge-window-horizontally)
  (bind-key "C-s-<down>"  'shrink-window)
  (bind-key "C-s-<up>"    'enlarge-window)
#+END_SRC

Whenever I split windows, I usually do so and also switch to the other
window as well, so might as well rebind the splitting key bindings to
do just that to reduce the repetition.

#+BEGIN_SRC emacs-lisp
(defun vsplit-other-window ()
  "Splits the window vertically and switches to that window."
  (interactive)
  (split-window-vertically)
  (other-window 1 nil))
(defun hsplit-other-window ()
  "Splits the window horizontally and switches to that window."
  (interactive)
  (split-window-horizontally)
  (other-window 1 nil))

(bind-key "C-x 2" 'vsplit-other-window)
(bind-key "C-x 3" 'hsplit-other-window)
#+END_SRC
* Whitespace mode
Because sometimes you have to look at python code that came from a person with unusual editor defaults.
#+BEGIN_SRC emacs-lisp
(use-package whitespace
  :bind ("s-<f10>" . whitespace-mode))
#+END_SRC
* File Management
** Dired
Dired configuration is split between =init.el= and this clause in =config.org=, for reasons related to the way that emacs is initialised in this regime. If dired is not configured early, emacs throws to the debugger with an error when dired is called in regular use. (I don't know if this is still true.)
#+BEGIN_SRC emacs-lisp
  (use-package dired-single
    :ensure t
    :after dired)

  (use-package all-the-icons-dired
    :straight t
    :after dired
    :hook (dired-mode . all-the-icons-dired-mode))
#+END_SRC
* Minor conveniences
Emacs is at it's best when it just does things for you, or shows you
the way. This can best be achieved using a number of small extensions.
While on their own they might not be particularly impressive. Together
they create a nice environment for you to work in.

** visiting the configuration
Quickly edit =~/.emacs.d/config.org=. The Emacs way being the Emacs way, this specific keybinding turns out to be one of the most useful quality of life changes in this config, which is odd, considering the triviality of the feature.

#+BEGIN_SRC emacs-lisp
  (defun config-visit ()
    (interactive)
    (find-file "~/.emacs.d/config.org"))
  (global-set-key (kbd "C-c e") 'config-visit)
#+END_SRC

** Reloading the configuration
Simply pressing =Control-c r= will reload this file, very handy.
You can also manually invoke =config-reload=.

#+BEGIN_SRC emacs-lisp
  (defun config-reload ()
    "Reloads ~/.emacs.d/config.org at runtime"
    (interactive)
    (org-babel-load-file (expand-file-name "~/.emacs.d/config.org")))
  (global-set-key (kbd "C-c r") 'config-reload)
#+END_SRC

** Subwords
Emacs treats camelCase strings as a single word by default, this
changes said behaviour.

#+BEGIN_SRC emacs-lisp
  (global-subword-mode 1)
#+END_SRC

** Beacon

While changing buffers or workspaces, the first thing you do is look
for your cursor. Unless you know its position, you can not move it
efficiently. Every time you change buffers, the current position of
your cursor will be briefly highlighted now.

... it appears at the momeent that beacon confuses the sly repl, which
we cannot abide. currently no time to chase this down.

#+BEGIN_SRC emacs-lisp
  (use-package beacon
    :straight t
    :config
    (beacon-mode 1))
#+END_SRC


* ELPA packages

These are the packages supporting our mission to interface with a Common Lisp program which exports a REPL on a socket (using swank or slynk), as well as a few to aid in moving around large files fast.

** Avy - a better Ace

[[https://github.com/abo-abo/avy][Avy]] integrates with Ace window, and works like Ace Jump mode.

#+begin_src emacs-lisp
  (use-package avy
    :straight t
    :config 
    (avy-setup-default)
    (set-face-attribute 'avy-lead-face-0 nil :background "blue" :foreground "yellow")
    (set-face-attribute 'avy-lead-face-1 nil :background "purple4" :foreground "goldenrod")
    (set-face-attribute 'avy-lead-face-1 nil :background "SlateBlue4" :foreground "light goldenrod")
    :bind
    ;; ("M-s-." . avy-goto-word-or-subword-1)
    ("M-s s" . avy-goto-char))
#+end_src
** C-Eldoc
   :PROPERTIES:
   :GitHub:   https://github.com/mooz/c-eldoc
   :END:
This package displays function signatures in the mode line.

#+BEGIN_SRC emacs-lisp
(use-package c-eldoc
  :commands c-turn-on-eldoc-mode
  :ensure t
  :init (add-hook 'c-mode-hook #'c-turn-on-eldoc-mode))
#+END_SRC
** Crux
Collection of Ridiculously Useful eXtensions

#+BEGIN_SRC emacs-lisp
(use-package crux
  :straight t
  :bind (("C-c o o" . crux-open-with)
         ("C-c u" . crux-view-url)))
#+END_SRC
** Emmet
According to [[http://emmet.io/][their website]], "Emmet — the essential toolkit for web-developers."

#+BEGIN_SRC emacs-lisp
(use-package emmet-mode
  :ensure t
  :commands emmet-mode
  :config
  (add-hook 'html-mode-hook 'emmet-mode)
  (add-hook 'css-mode-hook 'emmet-mode))
#+END_SRC
** flycheck


#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :ensure t
    :diminish flycheck-mode
    :init (global-flycheck-mode))
  
  (use-package flycheck-cython
    :ensure t
    :after flycheck)
  
  (use-package flycheck-clojure
    :ensure t
    :init (flycheck-clojure-setup))
  
  (use-package flycheck-nim
    :ensure t
    :after flycheck)
#+END_SRC
   
