config.org
** Completion

#+begin_src emacs-lisp
  ;; vertico is the base for our Helm exodus.
  (use-package vertico
    :straight t
    :init
    (vertico-mode 1)
    :custom
    (vertico-count 13)
    (vertico-resize t)
    (vertico-cycle t)
    :config
    (vertico-mode))

  ;; this will put most recent items at the top of any given vertico selection.
  (use-package savehist
    :straight t
    :init
    (savehist-mode))

  ;; completion selection (narrowing) enhancements.
  (use-package consult
    :straight t
    :bind
    ("s-s o" . consult-outline)
    ("C-s" . consult-line)
    ("s-s s" . consult-ripgrep))

  ;; this is a completion style, which defines how we match against input.
  (use-package orderless
    :straight t
    :custom
    (completion-styles '(orderless))
    (completion-category-overrides '((file (styles . (partial-completion)))))
    (setq completion-category-defaults nil))

  ;; metadata around completion selections
  (use-package marginalia
    :straight t
    :custom 
    (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode 1))

  ;; actions within completion selections
  (use-package embark
    :straight t
    ;; this bind might clobber the sly mrepl shortcut command.
    :bind ("C-." . embark-act))

#+end_src

*** Company
#+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure nil
    :diminish company-mode
    ;; :bind (:map company-mode-map
    ;;             (("C-n" . company-select-next)
    ;;              ("C-p" . company-select-previous)
    ;;              ("C-d" . company-show-doc-buffer)
    ;;              ("M-." . company-show-location)))
    :config
    (progn
      ;; less than this and it disrupts typing when you aren't interested in completion.
      (setq company-idle-delay 0.9)
      (setq company-minimize-prefix-length 3)
      ;; company completion everywhere.
      (add-hook 'after-init-hook 'global-company-mode)
      (require 'color)

      (let ((bg (face-attribute 'default :background)))
        (custom-set-faces
         `(company-tooltip ((t (:inherit default :background ,(color-lighten-name bg 2)))))
         `(company-scrollbar-bg ((t (:background ,(color-lighten-name bg 10)))))
         `(company-scrollbar-fg ((t (:background ,(color-lighten-name bg 5)))))
         `(company-tooltip-selection ((t (:inherit font-lock-function-name-face))))
         `(company-tooltip-common ((t (:inherit font-lock-constant-face))))))

      (with-eval-after-load 'company
        (define-key company-active-map (kbd "M-n") nil)
        (define-key company-active-map (kbd "M-p") nil)
        (define-key company-active-map (kbd "C-n") #'company-select-next)
        (define-key company-active-map (kbd "C-p") #'company-select-previous)
        (define-key company-active-map (kbd "SPC") #'company-abort))))

  ;; (use-package company-box
  ;;   :after company)

  (use-package company-quickhelp
    :after (company)
    :hook (company-mode . company-quickhelp-mode)
    :config
    (setq company-quickhelp-delay 1.0)
    :ensure t)

#+END_SRC



** Helpful
This package gives richer help information, and makes interrogating emacs more fruitful.
#+BEGIN_SRC emacs-lisp
  (use-package helpful
    :ensure t
    :config
    (global-set-key (kbd "C-h f") #'helpful-callable)
    (global-set-key (kbd "C-h v") #'helpful-variable)
    (global-set-key (kbd "C-h k") #'helpful-key)
    ;; Lookup the current symbol at point. C-c C-d is a common keybinding
    ;; for this in lisp modes.
    (global-set-key (kbd "C-c C-d") #'helpful-at-point)

    ;; Look up *F*unctions (excludes macros).
    ;;
    ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
    ;; already links to the manual, if a function is referenced there.
    (global-set-key (kbd "C-h F") #'helpful-function)

    ;; Look up *C*ommands.
    ;;
    ;; By default, C-h C is bound to describe `describe-coding-system'. I
    ;; don't find this very useful, but it's frequently useful to only
    ;; look at interactive functions.
    (global-set-key (kbd "C-h C") #'helpful-command))
#+END_SRC
** Magit

A great interface for git projects. It's much more pleasant to use
than the git interface on the command line. Use an easy keybinding to
access magit.

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :straight t
    :defer t
    :bind ("C-c g" . magit-status)
    :config
    (define-key magit-status-mode-map (kbd "q") 'magit-quit-session))

  (use-package forge
    :straight t
    :defer t
    :after magit
    :config
    (setq auth-source '("~/.authinfo")))
#+END_SRC

*** Fullscreen magit

#+BEGIN_QUOTE
The following code makes magit-status run alone in the frame, and then
restores the old window configuration when you quit out of magit.

No more juggling windows after commiting. It's magit bliss.
#+END_QUOTE
[[http://whattheemacsd.com/setup-magit.el-01.html][Source: Magnar Sveen]]

#+BEGIN_SRC emacs-lisp
  ;; full screen magit-status
  (defadvice magit-status (around magit-fullscreen activate)
    (window-configuration-to-register :magit-fullscreen)
    ad-do-it ;; ad-do-it is a special marker for 'around advice that refers to the wrapped function.
    (delete-other-windows))

  (defun magit-quit-session ()
    "Restores the previous window configuration and kills the magit buffer"
    (interactive)
    (kill-buffer)
    (jump-to-register :magit-fullscreen))
#+END_SRC
** Multiple cursors

We'll also need to ~(require 'multiple-cusors)~ because of [[https://github.com/magnars/multiple-cursors.el/issues/105][an autoload issue]].

#+BEGIN_SRC emacs-lisp
  (use-package multiple-cursors
    :ensure t
    :bind (("C-S-c C-S-c" . mc/edit-lines)
           ("C->"         . mc/mark-next-like-this)
           ("C-<"         . mc/mark-previous-like-this)
           ("C-c C-<"     . mc/mark-all-like-this)
           ("C-!"         . mc/mark-next-symbol-like-this)
           ("s-d"         . mc/mark-all-dwim)))
#+END_SRC
** Restclient

See [[http://emacsrocks.com/e15.html][Emacs Rocks! Episode 15]] to learn how restclient can help out with
testing APIs from within Emacs. The HTTP calls you make in the buffer
aren't constrainted within Emacs; there's the
=restclient-copy-curl-command= to get the equivalent =curl= call
string to keep things portable.

#+BEGIN_SRC emacs-lisp
  (use-package restclient
    :ensure t
    ;; :load-path "~/SourceCode/lisp/emacs_stuff/restclient.el"
    :mode ("\\.restclient\\'" . restclient-mode))
#+END_SRC
** Scratch

Convenient package to create =*scratch*= buffers that are based on the
current buffer's major mode. This is more convienent than manually
creating a buffer to do some scratch work or reusing the initial
=*scratch*= buffer.

#+BEGIN_SRC emacs-lisp
(use-package scratch
  :ensure t
  :commands scratch)
#+END_SRC
** Undo Tree
#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
    :straight t
    :diminish undo-tree-mode
    :config
    (global-undo-tree-mode)
    :custom
    (undo-tree-auto-save-history nil))
#+END_SRC
** Visible mode

I found out about this mode by looking through simple.el. I use it to
see raw org-mode files without going to a different mode like
text-mode, which is what I had done in order to see invisible text
(with org hyperlinks). The entire buffer contents will be visible
while still being in org mode.

#+BEGIN_SRC emacs-lisp
(use-package visible-mode
  :bind (("H-v" . visible-mode)
         ("s-<f2>" . visible-mode)))
#+END_SRC
** Yasnippet
Yeah, snippets! I start with snippets from [[https://github.com/AndreaCrotti/yasnippet-snippets][Andrea Crotti's collection]]
and have also modified them and added my own.

It takes a few seconds to load and I don't need them immediately when
Emacs starts up, so we can defer loading yasnippet until there's some
idle time.
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :straight t
    :config
    ;; (setq yas-snippet-dirs (concat user-emacs-directory "snippets"))
    (yas-reload-all)
    (yas-global-mode))

  (use-package yasnippet-snippets
      :straight t
      :after yasnippet)

  (use-package common-lisp-snippets
      :straight t
      :after yasnippet)
#+END_SRC

* Languages
** Generically useful programming utilities
   #+BEGIN_SRC emacs-lisp
     (use-package yatemplate
       :straight t)   
   #+END_SRC
** CSV mode
   #+BEGIN_SRC emacs-lisp
     (use-package csv-mode
       :ensure t)
   #+END_SRC
** Common Lisp
