config.el

;; vertico is the base for our Helm exodus.
(use-package vertico
  :straight t
  :init
  (vertico-mode 1)
  :custom
  (vertico-count 13)
  (vertico-resize t)
  (vertico-cycle t)
  :config
  (vertico-mode))

;; this will put most recent items at the top of any given vertico selection.
(use-package savehist
  :straight t
  :init
  (savehist-mode))

;; completion selection (narrowing) enhancements.
(use-package consult
  :straight t
  :bind
  ("s-s o" . consult-outline)
  ("C-s" . consult-line)
  ("s-s s" . consult-ripgrep))

;; this is a completion style, which defines how we match against input.
(use-package orderless
  :straight t
  :custom
  (completion-styles '(orderless))
  (completion-category-overrides '((file (styles . (partial-completion)))))
  (setq completion-category-defaults nil))

;; metadata around completion selections
(use-package marginalia
  :straight t
  :custom 
  (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode 1))

;; actions within completion selections
(use-package embark
  :straight t
  ;; this bind might clobber the sly mrepl shortcut command.
  :bind ("C-." . embark-act))

(use-package company
  :ensure nil
  :diminish company-mode
  ;; :bind (:map company-mode-map
  ;;             (("C-n" . company-select-next)
  ;;              ("C-p" . company-select-previous)
  ;;              ("C-d" . company-show-doc-buffer)
  ;;              ("M-." . company-show-location)))
  :config
  (progn
    ;; less than this and it disrupts typing when you aren't interested in completion.
    (setq company-idle-delay 0.9)
    (setq company-minimize-prefix-length 3)
    ;; company completion everywhere.
    (add-hook 'after-init-hook 'global-company-mode)
    (require 'color)

    (let ((bg (face-attribute 'default :background)))
      (custom-set-faces
       `(company-tooltip ((t (:inherit default :background ,(color-lighten-name bg 2)))))
       `(company-scrollbar-bg ((t (:background ,(color-lighten-name bg 10)))))
       `(company-scrollbar-fg ((t (:background ,(color-lighten-name bg 5)))))
       `(company-tooltip-selection ((t (:inherit font-lock-function-name-face))))
       `(company-tooltip-common ((t (:inherit font-lock-constant-face))))))

    (with-eval-after-load 'company
      (define-key company-active-map (kbd "M-n") nil)
      (define-key company-active-map (kbd "M-p") nil)
      (define-key company-active-map (kbd "C-n") #'company-select-next)
      (define-key company-active-map (kbd "C-p") #'company-select-previous)
      (define-key company-active-map (kbd "SPC") #'company-abort))))

;; (use-package company-box
;;   :after company)

(use-package company-quickhelp
  :after (company)
  :hook (company-mode . company-quickhelp-mode)
  :config
  (setq company-quickhelp-delay 1.0)
  :ensure t)

(use-package helpful
  :ensure t
  :config
  (global-set-key (kbd "C-h f") #'helpful-callable)
  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)
  ;; Lookup the current symbol at point. C-c C-d is a common keybinding
  ;; for this in lisp modes.
  (global-set-key (kbd "C-c C-d") #'helpful-at-point)

  ;; Look up *F*unctions (excludes macros).
  ;;
  ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
  ;; already links to the manual, if a function is referenced there.
  (global-set-key (kbd "C-h F") #'helpful-function)

  ;; Look up *C*ommands.
  ;;
  ;; By default, C-h C is bound to describe `describe-coding-system'. I
  ;; don't find this very useful, but it's frequently useful to only
  ;; look at interactive functions.
  (global-set-key (kbd "C-h C") #'helpful-command))

(use-package magit
  :straight t
  :defer t
  :bind ("C-c g" . magit-status)
  :config
  (define-key magit-status-mode-map (kbd "q") 'magit-quit-session))

(use-package forge
  :straight t
  :defer t
  :after magit
  :config
  (setq auth-source '("~/.authinfo")))

;; full screen magit-status
(defadvice magit-status (around magit-fullscreen activate)
  (window-configuration-to-register :magit-fullscreen)
  ad-do-it ;; ad-do-it is a special marker for 'around advice that refers to the wrapped function.
  (delete-other-windows))

(defun magit-quit-session ()
  "Restores the previous window configuration and kills the magit buffer"
  (interactive)
  (kill-buffer)
  (jump-to-register :magit-fullscreen))

(use-package multiple-cursors
  :ensure t
  :bind (("C-S-c C-S-c" . mc/edit-lines)
         ("C->"         . mc/mark-next-like-this)
         ("C-<"         . mc/mark-previous-like-this)
         ("C-c C-<"     . mc/mark-all-like-this)
         ("C-!"         . mc/mark-next-symbol-like-this)
         ("s-d"         . mc/mark-all-dwim)))

(use-package restclient
  :ensure t
  ;; :load-path "~/SourceCode/lisp/emacs_stuff/restclient.el"
  :mode ("\\.restclient\\'" . restclient-mode))

(use-package scratch
  :ensure t
  :commands scratch)

(use-package undo-tree
  :straight t
  :diminish undo-tree-mode
  :config
  (global-undo-tree-mode)
  :custom
  (undo-tree-auto-save-history nil))

(use-package visible-mode
  :bind (("H-v" . visible-mode)
         ("s-<f2>" . visible-mode)))

(use-package yasnippet
  :straight t
  :config
  ;; (setq yas-snippet-dirs (concat user-emacs-directory "snippets"))
  (yas-reload-all)
  (yas-global-mode))

(use-package yasnippet-snippets
    :straight t
    :after yasnippet)

(use-package common-lisp-snippets
    :straight t
    :after yasnippet)

(use-package yatemplate
  :straight t)

(use-package csv-mode
  :ensure t)

(use-package sly
