config.org
*** SLY
    The jury has returned. Sly is superior to Slime.
    
#+BEGIN_SRC emacs-lisp
  (use-package sly
    ;; :load-path "~/SourceCode/lisp/sly"
    :straight t
    :defer t
    :commands sly
    :bind ("C-c M-o" . sly-mrepl-clear-repl)
    :init
    (progn
      (setq sly-lisp-implementations
            '((sbcl ("/usr/local/bin/sbcl"))
              (ccl ("/usr/bin/ccl"))
              (abcl ("/usr/local/src/abcl/abcl"))
              (clisp ("/usr/bin/clisp"))
              (ecl ("/usr/local/bin/ecl"))
              (decl ("/usr/bin/ecl"))
              (clojure ("/usr/bin/clojure"))))

      (setq sly-kill-without-query-p t
            sly-net-coding-system 'utf-8-unix
            sly-complete-symbol*-fancy t
            common-lisp-hyperspec "~/SourceCode/lisp/HyperSpec"))

    :config
    (progn
      (require 'sly-autoloads)))

  (use-package sly-asdf
    ;; :load-path "~/SourceCode/lisp/sly-asdf"
    :straight t
    :after sly)

  (use-package sly-macrostep
    :straight t
    :after sly)

  (use-package sly-named-readtables
    :straight t
    :after sly)

  (use-package sly-repl-ansi-color
    :straight t
    :after sly)

  (use-package sly-quicklisp
    :straight t
    :after sly)
#+END_SRC

#+RESULTS:

*** Paredit

I spend almost all of my time in emacs writing common lisp code, and in that endeavour, Paredit is the single most useful package in my configuration. It allows me to treat code as structure, moving forms in their entirety. It also ensures that the famous parenthesis are always balanced, and that I usually only have to type the opening 50% of them. This mode is useful in all programming languages for the paren matching features, but it is indespensible if you write any lisp dialect regularly.

#+BEGIN_SRC emacs-lisp
  (use-package paredit
    :straight t
    ;; :diminish paredit-mode
    :config
    (progn
      (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
      (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
      (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
      (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
      (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
      (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
      (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
      ;; (add-hook 'slime-repl-mode-hook       #'enable-paredit-mode)
      (add-hook 'sly-mrepl-mode-hook        #'enable-paredit-mode)
      ;; (add-hook 'slime-mode-hook            #'enable-paredit-mode)
      ;; (add-hook 'clojure-mode-hook          #'enable-paredit-mode)
      ;; (add-hook 'cider-repl-mode-hook       #'enable-paredit-mode)
      ))
#+END_SRC


** JavaScript
  #+BEGIN_SRC elisp
    (use-package js2-mode
      :ensure t
      :init
      (setq js-basic-indent 2)
      (setq-default ;; js2-basic-indent 2
                    ;; js2-basic-offset 2
                    ;; js2-auto-indent-p t
                    ;; js2-cleanup-whitespace t
                    ;; js2-enter-indents-newline t
                    ;; js2-indent-on-enter-key t
                    js2-global-externs (list "window" "module" "require" "buster" "sinon" "assert" "refute" "setTimeout" "clearTimeout" "setInterval" "clearInterval" "location" "__dirname" "console" "JSON" "jQuery" "$"))
    
      (add-hook 'js2-mode-hook
                (lambda ()
                  (push '("function" . ?ƒ) prettify-symbols-alist)))
    
      (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
      :custom
      (js2-basic-indent 2)
      (js2-basic-offset 2)
      (js2-auto-indent-p t)
      (js2-cleanup-whitespace t)
      (js2-enter-indents-newline t)
      (js2-indent-on-enter-key t))
  #+END_SRC

  #+RESULTS:

    Color /defined/ variables with [[https://github.com/ankurdave/color-identifiers-mode][color-identifiers-mode]]:

  #+BEGIN_SRC elisp
   (use-package color-identifiers-mode
       :ensure t
       :init
         (add-hook 'js2-mode-hook 'color-identifiers-mode))
  #+END_SRC

    While editing mode for JavaScript is baked into Emacs, it is quite important
  to have [[http://flycheck.readthedocs.org/][flycheck]] validate the source based on [[http://www.jshint.com/][jshint]], and [[https://github.com/eslint/eslint][eslint]].
  Let’s prefer =eslint=:

  #+BEGIN_SRC elisp
    (add-hook 'js2-mode-hook
              (lambda () (flycheck-select-checker "javascript-eslint")))
  #+END_SRC

*** Refactoring JavaScript

    The [[https://github.com/magnars/js2-refactor.el][js2-refactor]] mode should start with =C-c .= and then a two-letter
    mnemonic shortcut.

    * =ef= is =extract-function=: Extracts the marked expressions out into a new named function.
    * =em= is =extract-method=: Extracts the marked expressions out into a new named method in an object literal.
    * =ip= is =introduce-parameter=: Changes the marked expression to a parameter in a local function.
    * =lp= is =localize-parameter=: Changes a parameter to a local var in a local function.
    * =eo= is =expand-object=: Converts a one line object literal to multiline.
    * =co= is =contract-object=: Converts a multiline object literal to one line.
    * =eu= is =expand-function=: Converts a one line function to multiline (expecting semicolons as statement delimiters).
    * =cu= is =contract-function=: Converts a multiline function to one line (expecting semicolons as statement delimiters).
    * =ea= is =expand-array=: Converts a one line array to multiline.
    * =ca= is =contract-array=: Converts a multiline array to one line.
    * =wi= is =wrap-buffer-in-iife=: Wraps the entire buffer in an immediately invoked function expression
    * =ig= is =inject-global-in-iife=: Creates a shortcut for a marked global by injecting it in the wrapping immediately invoked function expression
    * =ag= is =add-to-globals-annotation=: Creates a =/*global */= annotation if it is missing, and adds the var at point to it.
    * =ev= is =extract-var=: Takes a marked expression and replaces it with a var.
    * =iv= is =inline-var=: Replaces all instances of a variable with its initial value.
    * =rv= is =rename-var=: Renames the variable on point and all occurrences in its lexical scope.
    * =vt= is =var-to-this=: Changes local =var a= to be =this.a= instead.
    * =ao= is =arguments-to-object=: Replaces arguments to a function call with an object literal of named arguments. Requires yasnippets.
    * =3i= is =ternary-to-if=: Converts ternary operator to if-statement.
    * =sv= is =split-var-declaration=: Splits a =var= with multiple vars declared, into several =var= statements.
    * =uw= is =unwrap=: Replaces the parent statement with the selected region.

  #+BEGIN_SRC elisp
  (use-package js2-refactor
    :ensure t
    :init   (add-hook 'js2-mode-hook 'js2-refactor-mode)
    :config (js2r-add-keybindings-with-prefix "C-c ."))
  #+END_SRC
  
*** Skewer

    I also configure Skewer for my [[file:emacs-web.org][HTML and CSS]] files, we need to do the
    same for JavaScript:

    #+BEGIN_SRC elisp
  (use-package skewer-mode
     :ensure t
     :init (add-hook 'js2-mode-hook 'skewer-mode))
    #+END_SRC

    Kick things off with =run-skewer=, and then:

   * C-x C-e :: `skewer-eval-last-expression'
   * C-M-x   :: `skewer-eval-defun'
   * C-c C-k :: `skewer-load-buffer'

** Python
Integrates with IPython., using elpy jedi, and virtualenvwrapper.

#+BEGIN_SRC emacs-lisp

  (use-package elpy
    :ensure t
    :config
    (setq elpy-rpc-backend "jedi")
    (setq python-shell-interpreter "ipython"
          python-shell-interpreter-args "-i --simple-prompt")
    (elpy-enable))

  (use-package jedi
    :ensure t
    :init
    (add-hook 'python-mode-hook 'jedi:setup)
    :config
    (local-set-key (kbd "M-.") 'jedi:goto-definition)
    (local-set-key (kbd "M-,") 'jedi:goto-definition-pop-marker)
    (local-set-key (kbd "M-?") 'jedi:show-doc)
    (local-set-key (kbd "M-/") 'jedi:get-in-function-call)
    (setq jedi:complete-on-dot t))

  (use-package company-jedi
    :ensure jedi
    :ensure t
    :config
    (add-to-list 'company-backends 'company-jedi))

  (use-package jinja2-mode
    :ensure t)

#+END_SRC

*** Virtualenvwrapper

#+BEGIN_SRC emacs-lisp
  (use-package virtualenvwrapper
    :ensure t
    :defer t
    :config
    (setq venv-location "~/.virtualenvs"))
#+END_SRC

** YAML mode
#+BEGIN_SRC emacs-lisp
(use-package yaml-mode
  :ensure t
  :defer t
  :config
  (add-hook 'yaml-mode-hook '(lambda () (ansible 1))))
#+END_SRC

* Modeline
  
The modeline is the heart of emacs, it offers information at all
times, it's persistent and verbose enough to gain a full understanding
of modes and states you are in.

One modeline-related setting that is missing and is instead placed at
the bottom is =diminish=.

** All the icons!
   
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons
    :straight t)
#+END_SRC
   
** Spaceline!
   I may not use spacemacs, since I do not like evil-mode and find
   spacemacs incredibly bloated and slow, however it would be stupid not
   to acknowledge the best parts about it, the theme and their modified
   powerline setup.

   This enables spaceline, it looks better and works very well with my
   theme of choice.

   #+BEGIN_SRC emacs-lisp :tangle no
     ;; (when window-system
     ;;     (progn
     ;;       (use-package spaceline
     ;;         :ensure t
     ;;         :config
     ;;         ;; (mis)using use-package here to put config in an envelope.
     ;;         (use-package spaceline-config
     ;;           :config
     ;;           (setq spaceline-buffer-encoding-abbrev-p t)
     ;;           (setq spaceline-line-column-p t)
     ;;           (setq spaceline-line-p t)

     ;;           (spaceline-toggle-flycheck-info-off)
     ;;           (spaceline-toggle-flycheck-error-off)
     ;;           (spaceline-toggle-flycheck-warning-off)
     ;;           (spaceline-toggle-version-control-on)

     ;;           (spaceline-spacemacs-theme)))

     ;;       (use-package spaceline-all-the-icons
     ;;         :ensure t
     ;;         :after spaceline
     ;;         :config
     ;;         (spaceline-all-the-icons-theme))))
   #+END_SRC
   
** Telephone Line
#+begin_src emacs-lisp :tangle no

  ;; (use-package telephone-line
  ;;   :ensure t
  ;;   :config
  ;;   (setf telephone-line-primary-left-separator 'telephone-line-cubed-left
  ;;         telephone-line-secondary-left-separator 'telephone-line-cubed-hollow-left
  ;;         telephone-line-primary-right-separator 'telephone-line-cubed-right
  ;;         telephone-line-secondary-right-separator 'telephone-line-cubed-hollow-right)
  ;;   (setf telephone-line-height 24
  ;;         telephone-line-evil-use-short-tag t)
  ;;   ;; actually use it.
  ;;   (telephone-line-mode 1))

#+end_src

** No separator!

 #+BEGIN_SRC emacs-lisp
 (setq powerline-default-separator nil)
 #+END_SRC

** Cursor position

   Show the current line and column for your cursor. We are not going to
have =relative-linum-mode= in every major mode, so this is useful.

#+BEGIN_SRC emacs-lisp
  ;; (setq line-number-mode t)
  ;; (setq column-number-mode t)
#+END_SRC

** Clock
If you prefer the 12hr-format, change the variable to =nil= instead of =t=.
*** Time format
#+BEGIN_SRC emacs-lisp
  (setq display-time-24hr-format t)
  (setq display-time-format "%H:%M - %d %B %Y")
  (display-time-mode 1)
#+END_SRC



* Theme
