config.el
  ;; :load-path "~/SourceCode/lisp/sly"
  :straight t
  :defer t
  :commands sly
  :bind ("C-c M-o" . sly-mrepl-clear-repl)
  :init
  (progn
    (setq sly-lisp-implementations
          '((sbcl ("/usr/local/bin/sbcl"))
            (ccl ("/usr/bin/ccl"))
            (abcl ("/usr/local/src/abcl/abcl"))
            (clisp ("/usr/bin/clisp"))
            (ecl ("/usr/local/bin/ecl"))
            (decl ("/usr/bin/ecl"))
            (clojure ("/usr/bin/clojure"))))

    (setq sly-kill-without-query-p t
          sly-net-coding-system 'utf-8-unix
          sly-complete-symbol*-fancy t
          common-lisp-hyperspec "~/SourceCode/lisp/HyperSpec"))

  :config
  (progn
    (require 'sly-autoloads)))

(use-package sly-asdf
  ;; :load-path "~/SourceCode/lisp/sly-asdf"
  :straight t
  :after sly)

(use-package sly-macrostep
  :straight t
  :after sly)

(use-package sly-named-readtables
  :straight t
  :after sly)

(use-package sly-repl-ansi-color
  :straight t
  :after sly)

(use-package sly-quicklisp
  :straight t
  :after sly)

(use-package paredit
  :straight t
  ;; :diminish paredit-mode
  :config
  (progn
    (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
    (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
    (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
    (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
    (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
    (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
    ;; (add-hook 'slime-repl-mode-hook       #'enable-paredit-mode)
    (add-hook 'sly-mrepl-mode-hook        #'enable-paredit-mode)
    ;; (add-hook 'slime-mode-hook            #'enable-paredit-mode)
    ;; (add-hook 'clojure-mode-hook          #'enable-paredit-mode)
    ;; (add-hook 'cider-repl-mode-hook       #'enable-paredit-mode)
    ))

(use-package js2-mode
  :ensure t
  :init
  (setq js-basic-indent 2)
  (setq-default ;; js2-basic-indent 2
                ;; js2-basic-offset 2
                ;; js2-auto-indent-p t
                ;; js2-cleanup-whitespace t
                ;; js2-enter-indents-newline t
                ;; js2-indent-on-enter-key t
                js2-global-externs (list "window" "module" "require" "buster" "sinon" "assert" "refute" "setTimeout" "clearTimeout" "setInterval" "clearInterval" "location" "__dirname" "console" "JSON" "jQuery" "$"))

  (add-hook 'js2-mode-hook
            (lambda ()
              (push '("function" . ?ƒ) prettify-symbols-alist)))

  (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
  :custom
  (js2-basic-indent 2)
  (js2-basic-offset 2)
  (js2-auto-indent-p t)
  (js2-cleanup-whitespace t)
  (js2-enter-indents-newline t)
  (js2-indent-on-enter-key t))

(use-package color-identifiers-mode
    :ensure t
    :init
      (add-hook 'js2-mode-hook 'color-identifiers-mode))

(add-hook 'js2-mode-hook
          (lambda () (flycheck-select-checker "javascript-eslint")))

(use-package js2-refactor
  :ensure t
  :init   (add-hook 'js2-mode-hook 'js2-refactor-mode)
  :config (js2r-add-keybindings-with-prefix "C-c ."))

(use-package skewer-mode
   :ensure t
   :init (add-hook 'js2-mode-hook 'skewer-mode))

(use-package elpy
  :ensure t
  :config
  (setq elpy-rpc-backend "jedi")
  (setq python-shell-interpreter "ipython"
        python-shell-interpreter-args "-i --simple-prompt")
  (elpy-enable))

(use-package jedi
  :ensure t
  :init
  (add-hook 'python-mode-hook 'jedi:setup)
  :config
  (local-set-key (kbd "M-.") 'jedi:goto-definition)
  (local-set-key (kbd "M-,") 'jedi:goto-definition-pop-marker)
  (local-set-key (kbd "M-?") 'jedi:show-doc)
  (local-set-key (kbd "M-/") 'jedi:get-in-function-call)
  (setq jedi:complete-on-dot t))

(use-package company-jedi
  :ensure jedi
  :ensure t
  :config
  (add-to-list 'company-backends 'company-jedi))

(use-package jinja2-mode
  :ensure t)

(use-package virtualenvwrapper
  :ensure t
  :defer t
  :config
  (setq venv-location "~/.virtualenvs"))

(use-package yaml-mode
  :ensure t
  :defer t
  :config
  (add-hook 'yaml-mode-hook '(lambda () (ansible 1))))

(use-package all-the-icons
  :straight t)

(setq powerline-default-separator nil)

;; (setq line-number-mode t)
;; (setq column-number-mode t)

(setq display-time-24hr-format t)
(setq display-time-format "%H:%M - %d %B %Y")
(display-time-mode 1)
