config.org
** Autothemer

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (use-package autothemer
  ;;   :ensure t)
#+END_SRC

** Emacs' startup screen is naf

#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
#+END_SRC

** Colours On Terminal
   custom colour themes generally enhance my experience of writing
   inside emacs, but when that theme is applied to an instance running
   inside a terminal, the effect is really just terrible. This mode
   kind of approximates the effect of a graphical emacs frame, in a
   text console.
   
#+BEGIN_SRC emacs-lisp
(use-package color-theme-approximate
  :ensure t
  :config
  (unless (display-graphic-p)
    (autoload 'color-theme-approximate-on "color-theme-approximate")
    (color-theme-approximate-on)))
#+END_SRC

** Cursor tomfoolery
   A fun hack that is in practice unusable.

#+BEGIN_SRC emacs-lisp :tangle no

  ;; if this is set here, it is overwritten by the colour theme.
  ;; (set-cursor-color "yellow")

  ;; (when (display-graphic-p) 
  ;;   (progn
  ;;     (defvar blink-cursor-colors (list
  ;;                                  "dark slate blue"
  ;;                                  "medium slate blue"
  ;;                                  "light slate blue"
  ;;                                  "steel blue"
  ;;                                  "royal blue"
  ;;                                  "light blue"
  ;;                                  "cyan"
  ;;                                  "cyan1"
  ;;                                  "cyan2"
  ;;                                  "cyan3"
  ;;                                  "cyan4"
  ;;                                  "spring green"
  ;;                                  "yellow"
  ;;                                  "orange"
  ;;                                  "red"
  ;;                                  "hot pink")
  ;;       "On each blink the cursor will cycle to the next color in this list.")
    
  ;;     (setq blink-cursor-count 0)
  ;;     (setq blink-cursor-interval 0.3)
  ;;     (defun blink-cursor-timer-function ()
  ;;       "Zarza wrote this cyberpunk variant of timer `blink-cursor-timer'. 
  ;;      Warning: overwrites original version in `frame.el'.

  ;;      This one changes the cursor color on each blink. Define colors in `blink-cursor-colors'."

  ;;       (when (not (internal-show-cursor-p))
  ;;         (when (>= blink-cursor-count (length blink-cursor-colors))
  ;;           (setq blink-cursor-count 0))
  ;;         (set-cursor-color (nth blink-cursor-count blink-cursor-colors))
  ;;         (setq blink-cursor-count (+ 1 blink-cursor-count)))
  ;;       (internal-show-cursor nil (not (internal-show-cursor-p))))))

#+END_SRC

** DeepSky Theme

   Load the appropriate theme, and a utility for arbitrarily loading
   others.

#+BEGIN_SRC emacs-lisp

  (progn
    ;; on the terminal, the theme situation needs more attention.
    (message "Loading DeepSky theme... ")
    (load-theme 'deepsky-modus-fade t)
    (message "Configuring mode-line appearance...")
    (set-face-attribute `mode-line nil
                        :box nil)
    (message "Setting cursor colour...")
    (set-cursor-color "yellow"))

#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun switch-theme (theme)
    "Disables any currently active themes and loads THEME."
    ;; This interactive call is taken from `load-theme'
    (interactive
     (list
      (intern (completing-read "Load custom theme: "
                               (mapc 'symbol-name
                                     (custom-available-themes))))))
    (let ((enabled-themes custom-enabled-themes))
      (mapc #'disable-theme custom-enabled-themes)
      (load-theme theme t)))

  (defun disable-active-themes ()
    "Disables any currently active themes listed in `custom-enabled-themes'."
    (interactive)
    (mapc #'disable-theme custom-enabled-themes))

  (bind-key "s-<f12>" 'switch-theme)
  (bind-key "s-<f11>" 'disable-active-themes)
#+END_SRC

